# DividedpathDisplayReferenceCurves Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DividedpathDisplayReferenceCurves Property
ParameterTypeId Class See Also
---
"Display Path"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DividedpathDisplayReferenceCurves { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DividedpathDisplayReferenceCurves As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DividedpathDisplayReferenceCurves {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace